---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.InstanceLengthParam
source: html/3f72138a-62c2-cb73-3d33-034607dcbbd8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.InstanceLengthParam Property

"Length"

## Syntax (C#)
```csharp
public static ForgeTypeId InstanceLengthParam { get; }
```